Revit 2024 API
BuiltInFailures.RegenFailures.CircularDependencyConstraint Property
 Highlighted constraints cause a circular chain of references.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CircularDependencyConstraint { get; }
Visual Basic
Public Shared ReadOnly Property CircularDependencyConstraint As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CircularDependencyConstraint {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RegenFailures Class
Autodesk.Revit.DB Namespace